#include <vector>

namespace game_framework {
	/////////////////////////////////////////////////////////////////////////////
	// 這個class提供可以用鍵盤或滑鼠控制的擦子
	// 看懂就可以改寫成自己的程式了
	/////////////////////////////////////////////////////////////////////////////

	class Cmap {
	public:
		Cmap();
		void LoadBitmap();	//載入圖片
		bool isObj(int x, int y);		//判斷有沒有東西
		void OnShow();		//顯示圖片
		void interaction(int x, int y);	//與方塊互動
		void test(int num);
	protected:
		CMovingBitmap		Mapobj;
		int map[11][11] = { {2,2,2,2,2,0,2,2,2,2,2},
							{0,0,0,0,0,0,0,0,0,0,0},
							{0,0,0,0,0,0,0,0,0,0,0},
							{0,0,0,0,0,0,0,0,0,0,0},
							{0,0,0,0,0,0,0,0,0,0,0},
							{0,0,0,0,0,0,0,0,0,0,0},
							{0,0,0,0,0,0,0,0,0,0,0},
							{0,0,0,0,0,0,0,0,0,0,0},
							{0,0,0,0,0,0,0,0,0,0,0},
							{0,0,0,0,0,0,0,0,0,0,0},
							{2,2,2,2,2,0,2,2,2,2,2} };	//地圖
		int test1;
		const int X, Y;						//座標
		const int MW, MH;					//圖寬
	};
}